Repository: danwar77/M3M3s
Catalog: lib/l10n/app_*.arb
Languages: es

# appTitle
source: M3M3s App
es: M3M3s App [es]

# loginScreenTitle
source: Login to M3M3s
es: Iniciar Sesión en M3M3s [es]

# signUpScreenTitle
source: Create Account
es: Crear Cuenta [es]

# createMemeWelcomeTitle
source: M3M3s
es: M3M3s [es]

# createMemeWelcomeTagline
source: Craft hilarious memes in seconds!
es: ¡Crea memes divertidos en segundos! [es]

# createMemeButton
source: Create New Meme
es: Crear Nuevo Meme [es]

# viewHistoryButton
source: View My History
es: Ver Mi Historial [es]

# historyScreenTitle
source: My Meme History
es: Mi Historial de Memes [es]

# textInputScreenTitle
source: Create Your Meme
es: Crea Tu Meme [es]

# memeDisplayScreenTitle
source: Preview & Edit Meme
es: Vista Previa y Editar Meme [es]

# selectTemplateTitle
source: Select a Template
es: Seleccionar Plantilla [es]

# addStickerTitle
source: Add a Sticker
es: Añadir Sticker [es]

# createTabLabel
source: Create
es: Crear [es]

# historyTabLabel
source: History
es: Historial [es]

# loginButtonText
source: Login
es: Iniciar Sesión [es]

# signUpButtonText
source: CREATE ACCOUNT
es: CREAR CUENTA [es]

# logoutButtonTooltip
source: Logout
es: Cerrar Sesión [es]

# languageButtonTooltip
source: Change Language
es: Cambiar Idioma [es]

# emailLabel
source: Email
es: Correo Electrónico [es]

# emailHint
source: you@example.com
es: tu@ejemplo.com [es]

# passwordLabel
source: Password
es: Contraseña [es]

# passwordHintLogin
source: Enter your password
es: Ingresa tu contraseña [es]

# passwordHintSignUp
source: Choose a strong password
es: Elige una contraseña segura [es]

# confirmPasswordLabel
source: Confirm Password
es: Confirmar Contraseña [es]

# confirmPasswordHint
source: Re-enter your password
es: Vuelve a ingresar tu contraseña [es]

# dontHaveAccount
source: Don't have an account?
es: ¿No tienes una cuenta? [es]

# alreadyHaveAccount
source: Already have an account?
es: ¿Ya tienes una cuenta? [es]

# signUpNowButton
source: Sign Up Now
es: Regístrate Ahora [es]

# loginHereButton
source: Login Here
es: Inicia Sesión Aquí [es]

# forgotPasswordButton
source: Forgot Password?
es: ¿Olvidaste tu contraseña? [es]

# topTextLabel
source: Top Text (Optional)
es: Texto Superior (Opcional) [es]

# bottomTextLabel
source: Bottom Text (Optional)
es: Texto Inferior (Opcional) [es]

# chooseTemplateButton
source: Choose Template
es: Elegir Plantilla [es]

# uploadImageButton
source: Upload Custom
es: Subir Imagen [es]

# getSuggestionsButton
source: Get Suggestions & Prepare
es: Obtener Sugerencias y Preparar [es]

# saveButton
source: Save
es: Guardar [es]

# shareButton
source: Share
es: Compartir [es]

# addStickerButton
source: Add Sticker
es: Añadir Sticker [es]

# retryButton
source: Retry
es: Reintentar [es]

# refreshButton
source: Refresh
es: Actualizar [es]

# selectColorButton
source: Select Color
es: Seleccionar Color [es]

# cancelButton
source: Cancel
es: Cancelar [es]

source: Loading templates...
es: Cargando plantillas... [es]

# loadingHistory
source: Loading your meme history...
es: Cargando tu historial de memes... [es]

# errorLoadingTemplates
source: Oops! Couldn't load templates. Please check your connection and try again.
es: ¡Ups! No se pudieron cargar las plantillas. Por favor, revisa tu conexión e inténtalo de nuevo. [es]

# errorLoadingHistory
source: Oops! Could not load your history.
es: ¡Ups! No se pudo cargar tu historial. [es]

# errorLoginUserNotAuthenticated
source: Please log in to see your meme history.
es: Por favor, inicia sesión para ver tu historial de memes. [es]

# noTemplatesFound
source: No templates found. Try refreshing or check back later!
es: No se encontraron plantillas. ¡Intenta actualizar o revisa más tarde! [es]

# noHistoryFound
source: No memes found in your history yet.
es: Aún no hay memes en tu historial. [es]

# noHistoryFoundPrompt
source: Go create some awesome memes!
es: ¡Anímate y crea memes geniales! [es]

# createFirstMemeButton
source: Create First Meme!
es: ¡Crear Primer Meme! [es]

# stickerAddedSnackbar
source: Sticker added! Drag to position.
es: ¡Sticker añadido! Arrástralo para posicionarlo. [es]

# stickerRemovedSnackbar
source: Sticker removed.
es: Sticker eliminado. [es]

# keywordTappedSnackbar
source: Keyword "{keyword}" tapped. Future: Use for filtering or tagging.
es: Palabra clave "{keyword}" tocada. Futuro: Usar para filtrar o etiquetar. [es]

# loadingSuggestionDetailsSnackbar
source: Loading details for "{templateName}"...
es: Cargando detalles para "{templateName}"... [es]

# templateSelectedSnackbar
source: "{templateName}" selected.
es: "{templateName}" seleccionada. [es]

# errorLoadingTemplateDetailsSnackbar
source: Error loading details for "{templateName}": {errorMessage}
es: Error al cargar detalles para "{templateName}": {errorMessage} [es]

# customImageSelectedSnackbar
source: Custom image selected!
es: ¡Imagen personalizada seleccionada! [es]

# noImageSelectedSnackbar
source: No image selected.
es: Ninguna imagen seleccionada. [es]

# errorPickingImageSnackbar
source: Error picking image: {errorMessage}
es: Error al seleccionar imagen: {errorMessage} [es]

# memeSavedSuccessSnackbar
source: Meme saved successfully!
es: ¡Meme guardado con éxito! [es]

# savingMemeSnackbar
source: Saving meme...
es: Guardando meme... [es]

# errorSavingMemeSnackbar
source: Error saving meme: {errorMessage}
es: Error al guardar meme: {errorMessage} [es]

# preparingShareSnackbar
source: Preparing meme for sharing...
es: Preparando meme para compartir... [es]

# errorSharingMemeSnackbar
source: Error sharing meme: {errorMessage}
es: Error al compartir meme: {errorMessage} [es]

# shareDismissedSnackbar
source: Sharing dismissed.
es: Compartir cancelado. [es]

# shareSuccessSnackbar
source: Meme shared successfully!
es: ¡Meme compartido con éxito! [es]

# loginSuccessfulSnackbar
source: Login successful!
es: ¡Inicio de sesión exitoso! [es]

# loginFailedInvalidCredentialsSnackbar
source: Invalid email or password. Please check your credentials.
es: Correo o contraseña incorrectos. Por favor, verifica tus credenciales. [es]

# loginFailedEmailNotConfirmedSnackbar
source: Please confirm your email address before logging in.
es: Por favor, confirma tu correo electrónico antes de iniciar sesión. [es]

# loginFailedSnackbar
source: Login failed. Please try again.
es: Falló el inicio de sesión. Por favor, inténtalo de nuevo. [es]

# signUpSuccessfulEmailConfirmationSnackbar
source: Sign-up successful! Please check your email to confirm your account.
es: ¡Registro exitoso! Por favor, revisa tu correo para confirmar tu cuenta. [es]

# signUpSuccessfulSnackbar
source: Sign-up successful!
es: ¡Registro exitoso! [es]

# signUpFailedUserExistsSnackbar
source: This email is already registered. Please try logging in.
es: Este correo ya está registrado. Por favor, intenta iniciar sesión. [es]

# signUpFailedWeakPasswordSnackbar
source: Password is too short. It must be at least 6 characters.
es: La contraseña es muy corta. Debe tener al menos 6 caracteres. [es]

# signUpFailedSnackbar
source: Sign-up failed. Please try again.
es: Falló el registro. Por favor, inténtalo de nuevo. [es]

# logoutSuccessfulSnackbar
source: Successfully logged out.
es: Sesión cerrada exitosamente. [es]

# logoutFailedSnackbar
source: Logout failed: {errorMessage}
es: Falló el cierre de sesión: {errorMessage} [es]

# placeholderLanguageChangeSnackbar
source: Language change functionality to be implemented!
es: ¡Funcionalidad de cambio de idioma por implementar! [es]
